Performance/Results/2026-09-16-macos-c64/1-vapor-small-measured.txt
Running 5s test @ http://127.0.0.1:18080/bench/small
  4 threads and 64 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.03ms  506.29us  17.47ms   92.36%
    Req/Sec    15.58k     1.31k   17.18k    84.31%
  Latency Distribution
     50%    0.96ms
     75%    1.09ms
     90%    1.34ms
     99%    2.75ms
  316109 requests in 5.10s, 333.42MB read
Requests/sec:  61980.80
Transfer/sec:     65.38MB

METRICS {"requests":316109,"duration_us":5100112,"bytes":349616554,"p50_us":956,"p99_us":2754,"connect_errors":0,"read_errors":0,"write_errors":0,"status_errors":0,"timeouts":0}