Performance/Results/2026-09-16-macos-c64/1-vapor-tiny-warmup.txt
Running 3s test @ http://127.0.0.1:18080/bench/tiny
  4 threads and 64 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.05ms  507.03us   9.25ms   86.98%
    Req/Sec    15.19k     1.95k   18.28k    91.06%
  Latency Distribution
     50%    0.94ms
     75%    1.13ms
     90%    1.52ms
     99%    3.26ms
  185923 requests in 3.10s, 14.36MB read
Requests/sec:  59927.14
Transfer/sec:      4.63MB

METRICS {"requests":185923,"duration_us":3102484,"bytes":15059842,"p50_us":945,"p99_us":3256,"connect_errors":0,"read_errors":0,"write_errors":0,"status_errors":0,"timeouts":0}